monkeyboard/Honeywell-HIH6130-Humidity-Sensor-for-MonkeyBUS-PIC18/Firmware/main.c
/******************************************************************************
 * Function:        void PrintHihData (unsigned short humidity, 
 *						unsigned short temperature)
 *
 * PreCondition:    None
 *
 * Input:           Humidity and temperature reading
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine prints reading to USB serial emulator
 *					H<Humidity %>T<Temperature C>
 *
 * Note:            
 *
 *****************************************************************************/
void PrintHihData (unsigned short humidity, unsigned short temperature)
{
	NextUSBOut = 0;
	itoa (humidity, _buff);
	USB_Out_Buffer[NextUSBOut] = 'H';
	NextUSBOut++;
	strcpy (USB_Out_Buffer+NextUSBOut, _buff);
	NextUSBOut = strlen (USB_Out_Buffer);
	USB_Out_Buffer[NextUSBOut] = 'T';
	NextUSBOut ++;
	itoa (temperature, _buff);
	strcpy (USB_Out_Buffer+NextUSBOut, _buff);	
	NextUSBOut = strlen (USB_Out_Buffer);
	USB_Out_Buffer[NextUSBOut] = '\r';
	NextUSBOut ++;
	USB_Out_Buffer[NextUSBOut] = '\n';
	NextUSBOut = strlen (USB_Out_Buffer);
}

/** DECLARATIONS ***************************************************/
#pragma code

/******************************************************************************
 * Function:        void I2CGetBytes (unsigned char address, 
 *					unsigned char bytes, unsigned char *buff)
 *
 * PreCondition:    None
 *
 * Input:           Slave device address, number of bytes to be read,
 *					destination buffer
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine gets the number of bytes and store into the
 *					given buffer.
 *
 * Note:            
 *
 *****************************************************************************/
void I2CGetBytes (unsigned char address, unsigned char bytes, unsigned char *buff)
{
	char i = bytes;
	SendStart();	
	SendByte (address);
	for (i = 0; i < bytes - 1; i++)
	{
		buff[i] = ReceiveByte();
		SendAck();
	}
	buff[bytes - 1] = ReceiveByte();
	SendNack();
	SendStop();
}

/******************************************************************************
 * Function:        char GetHihReading (unsigned short *pHumd, 
 * 					short *pTemp)
 *
 * PreCondition:    None
 *
 * Input:           Humidity and temperature variable
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine gets humidity and temperature reading from
 *					HIH6130
 *
 * Note:            
 *
 *****************************************************************************/
char GetHihReading (unsigned short *pHumd, short *pTemp)
{
	char attempts = 0;
	unsigned long temp, temperature, humidity;
	unsigned char status = 0;
	//Delay to ensure sensor is ready
	Delay10KTCYx(100);	
	mLED_4_Off();
	SendStart();
	//Send write command
	SendByte (HIH6310 << 1);
	SendStop();
	do
	{
		Delay10KTCYx(50);
		//Get data with read command
		I2CGetBytes (((HIH6310 << 1) | 0x01), 4, &_buff);
		++attempts;
	}
	while ((_buff[0] & 0xC0) && (attempts < 5));
	status = (_buff[0] >> 6) & 0x03;
	temp = 0;
	temp = _buff [0] & 0x3F;
	
	//Conversations step by step
	humidity = temp << 8;
	humidity = humidity | _buff [1];
	humidity = humidity*100;
	humidity = humidity / 16383;
	temp = 0;
	temp = _buff[2];
	
	temperature = temp << 8;
	temperature = (temperature | _buff[3]);
	temperature = temperature >> 2;
	temperature = temperature * 165;
	temperature = temperature / 16383;

	*pTemp = (short)temperature;
	*pTemp -= 40;
	*pHumd = (unsigned short)humidity;
	mLED_4_On();
	return status;
}

/******************************************************************************
 * Function:        void main(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Main program entry point.
 *
 * Note:            None
 *****************************************************************************/
#if defined(__18CXX)
void main(void)
#else
int main(void)
#endif
{   
	unsigned short humidity;
	short temperature;
    InitializeSystem();

    #if defined(USB_INTERRUPT)
        USBDeviceAttach();
    #endif

    while(1)
    {
        #if defined(USB_POLLING)
		// Check bus status and service USB interrupts.
        USBDeviceTasks(); // Interrupt or polling method.  If using polling, must call
        				  // this function periodically.  This function will take care
        				  // of processing and responding to SETUP transactions 
        				  // (such as during the enumeration process when you first
        				  // plug in).  USB hosts require that USB devices should accept
        				  // and process SETUP packets in a timely fashion.  Therefore,
        				  // when using polling, this function should be called 
        				  // regularly (such as once every 1.8ms or faster** [see 
        				  // inline code comments in usb_device.c for explanation when
        				  // "or faster" applies])  In most cases, the USBDeviceTasks() 
        				  // function does not take very long to execute (ex: <100 
        				  // instruction cycles) before it returns.
        #endif
    				  

		// Application-specific tasks.
		// Application related code may be added here, or in the ProcessIO() function.

		ProcessIO();
		GetHihReading (&humidity, &temperature);
		PrintHihData (humidity, temperature);
		
    }//end while
}//end main


/********************************************************************
 * Function:        static void InitializeSystem(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        InitializeSystem is a centralize initialization
 *                  routine. All required USB initialization routines
 *                  are called from here.
 *
 *                  User application initialization routine should
 *                  also be called from here.                  
 *
 * Note:            None
 *******************************************************************/
static void InitializeSystem(void)
{
    #if (defined(__18CXX) & !defined(PIC18F87J50_PIM))
        ADCON1 |= 0x0F;                 // Default all pins to digital
    #elif defined(__C30__)
    	#if defined(__PIC24FJ256DA210__) || defined(__PIC24FJ256GB210__)
    		ANSA = 0x0000;
    		ANSB = 0x0000;
    		ANSC = 0x0000;
    		ANSD = 0x0000;
    		ANSE = 0x0000;
    		ANSF = 0x0000;
    		ANSG = 0x0000;
       #elif defined(__dsPIC33EP512MU810__) || defined (__PIC24EP512GU810__)
        	ANSELA = 0x0000;
    		ANSELB = 0x0000;
    		ANSELC = 0x0000;
    		ANSELD = 0x0000;
    		ANSELE = 0x0000;
    		ANSELG = 0x0000;
            

        #else
        	AD1PCFGL = 0xFFFF;
        #endif  
    #elif defined(__C32__)
        AD1PCFG = 0xFFFF;
    #endif

    #if defined(PIC18F87J50_PIM) || defined(PIC18F46J50_PIM) || defined(PIC18F47J53_PIM)
	//On the PIC18F87J50 Family of USB microcontrollers, the PLL will not power up and be enabled
	//by default, even if a PLL enabled oscillator configuration is selected (such as HS+PLL).
	//This allows the device to power up at a lower initial operating frequency, which can be
	//advantageous when powered from a source which is not gauranteed to be adequate for 48MHz
	//operation.  On these devices, user firmware needs to manually set the OSCTUNE<PLLEN> bit to
	//power up the PLL.
    {
        unsigned int pll_startup_counter = 600;
        OSCTUNEbits.PLLEN = 1;  //Enable the PLL and wait 2+ms until the PLL locks before enabling USB module
        while(pll_startup_counter--);
    }
    //Device switches over automatically to PLL output after PLL is locked and ready.
    #endif

